/*Ця функція застосовує метод reduce до масиву arrs. Reduce - це вбудований метод масиву в JavaScript, який дозволяє зменшити масив до одного значення шляхом застосування функції звуження до кожного елементу масиву.

Функція reduce() отримує два аргументи: функцію звуження та початкове значення. У даному випадку початкове значення встановлене на 0. Функція звуження отримує два аргументи: попереднє значення (c) та поточний елемент масиву (записаний як масив [a, b]).

У функції звуження [a, b] є розпакуванням масиву, що означає, що він буде розбитий на дві окремі змінні: a та b. Функція звуження обчислює результат шляхом додавання a та віднімання b та повертає нове значення для c, яке потім стає попереднім значенням наступної ітерації. Нарешті, reduce() повертає остаточне значення.

Отже, код arrs.reduce((c, [a, b]) => c + a - b, 0) обчислює суму різниць між елементами масиву arrs та повертає отриманий результат.*/

const number = arrs => arrs.reduce((c, [a, b]) => c + a - b, 0)

console.log(
  number([
    [10, 0],
    [3, 5],
    [5, 8],
  ]),
) //5
console.log(
  number([
    [3, 0],
    [9, 1],
    [4, 10],
    [12, 2],
    [6, 1],
    [7, 10],
  ]),
) //17
console.log(
  number([
    [3, 0],
    [9, 1],
    [4, 8],
    [12, 2],
    [6, 1],
    [7, 8],
  ]),
) //21
console.log(number([[0, 0]])) //0
